---
kind: type
id: T:Autodesk.Revit.DB.ChangeType
source: html/bf7c5e20-b639-da97-4586-4a0bc0010705.htm
---
# Autodesk.Revit.DB.ChangeType

A class representing a change that can be detected and tracked during Dynamic Update.

## Syntax (C#)
```csharp
public class ChangeType : IDisposable
```

## Remarks
ChangeTypes for specific changes can be obtained from the static methods available on
 Element .